package Mods;

import java.util.List;

import object.Users;

public class Staticobject {
public static Users currentuser=null;
public static List<String> CarObjectId=null;
//车辆牌子及车型
      private static  String brand = "奥迪 宝马 保时捷 奔驰 大众 迈巴赫 MINI 斯柯达 smart 威兹曼 别克 福特 悍马 Jeep吉普 凯迪拉克 克莱斯勒 林肯 欧宝 雪佛兰 标致 雷诺 雪铁龙 布嘉迪 法拉利 菲亚特 兰博基尼 玛莎拉蒂 本田 丰田 雷克萨斯 铃木 马自达 讴歌 日产 三菱 斯巴鲁 英菲尼迪 起亚 双龙 现代 阿斯顿马丁 宾利 捷豹 劳斯莱斯 路虎 莲花 MG 比亚迪 长安 长安商用 长城 长丰 帝豪 东风风行 东南 风神 广汽 哈飞 海马 红旗 华普 汇众 江淮 江铃 吉奥 金杯 开瑞 猎豹 力帆 理念 陆风 纳智捷 启辰 奇瑞 全球鹰 荣威 瑞麒 双环 思铭 威麟 五菱 川汽野马 英伦汽车 一汽 一汽吉林 一汽通用 中华 众泰 中兴 中誉 萨博 沃尔沃";
     public static   String[] carClasses = brand.split(" ");
       private static String str = "A4L ]中型车] \n" +
                "A6L ]中大型车]  \n" +
                "Q5 ]SUV]  \n" +
                "A1 ]小型车] \n" +
                "A3 ]紧凑型车] \n" +
                "A5双门 ]中型车]  \n" +
                "A5掀背 ]中型车] \n" +
                "A5敞篷 ]中型车]  \n" +
                "A7 ]跑车] \n" +
                "A8L ]豪华车]  \n" +
                "Q5（进口） ]SUV]  \n" +
                "Q7 ]SUV]  \n" +
                "R8 ]跑车]  \n" +
                "S5掀背 ]跑车]  \n" +
                "S5敞篷 ]跑车]  \n" +
                "S5双门 ]跑车]  \n" +
                "S8 ]豪华车] \n" +
                "TT ]跑车]  \n" +
                "\n" +
                "3系 ]中型车]  \n" +
                "5系 ]中大型车]\n" +
                "X1 ]SUV]  \n" +
                "1系敞篷 ]紧凑型车]  \n" +
                "1系 ]紧凑型车]  \n" +
                "1系双门 ]紧凑型车]  \n" +
                "1系M coupe ]紧凑型车]  \n" +
                "3系(进口) ]中型车]  \n" +
                "3系敞篷 ]跑车] \n" +
                "3系双门 ]跑车] 49.1万-69.8万 \n" +
                "5系 ]中大型车] 49.26万-77.36万 \n" +
                "5系GT ]中大型车] 80.9万-186.0万 \n" +
                "5系旅行车 ]中大型车]66.66万-66.66万 \n" +
                "6系敞篷 ]跑车] 118.6万-203.9万\n" +
                "6系双门 ]跑车] 118.6万-203.9万 \n" +
                "7系 ]豪华车] 89.8万-329.8万 \n" +
                "6系Gran Coupe ]跑车] 120.5万-120.5万 \n" +
                "M3 ]跑车] 106.6万-123.0万 \n" +
                "M5 ]跑车] 185.8万-185.8万 \n" +
                "M6 ]跑车] 229.8万-229.8万 \n" +
                "X1(进口) ]SUV] 36.7万-55.2万 \n" +
                "X3 ]SUV] 54.5万-70.9万 \n" +
                "X5 ]SUV] 73.0万-185.3万 \n" +
                "X5M ]SUV] 201.8万-201.8万 \n" +
                "X6 ]SUV] 103.0万-206.2万 \n" +
                "X6M ]SUV] 219.0万-219.0万 \n" +
                "Z4 ]跑车] 57.8万-90.6万 \n" +
                "\n" +
                "911 ]跑车] 147.6万-191.3万 \n" +
                "Boxster ]跑车] 70.4万-106.0万 \n" +
                "Cayman ]跑车] 74.5万-114.8万 \n" +
                "Cayenne ]SUV] 89.3万-207.6万 \n" +
                "Panamera ]豪华车] 113.98万-308.8万 \n" +
                "\n" +
                "C级 ]中型车] 30.8万-46.3万 \n" +
                "E级长轴距 ]中大型车] 43.8万-71.0万 \n" +
                "GLK级 ]SUV] 40.8万-55.7万 \n" +
                "凌特 ]MPV] 41.8万-45.8万 \n" +
                "威霆 ]MPV] 33.9万-33.9万 \n" +
                "唯雅诺 ]MPV] 41.9万-86.8万 \n" +
                "A级 ]小型车] 23.8万-27.8万 \n" +
                "SLK级 ]跑车] 60.8万-93.8万 \n" +
                "B级 ]紧凑型车] 28.8万-35.8万 \n" +
                "C63 AMG ]跑车] 99.8万-138.8万 \n" +
                "C级旅行 ]中型车] 42.5万-54.8万 \n" +
                "CLK级敞篷 ]跑车] 66.6万-91.8万 \n" +
                "CLS级 ]跑车] 76.8万-96.8万 \n" +
                "CLS级 AMG ]跑车] 177.8万-177.8万 \n" +
                "E级敞篷 ]中大型车] 73.8万-88.8万 \n" +
                "E级双门 ]中大型车] 61.8万-61.8万 \n" +
                "G55 AMG ]SUV] 225.8万-225.8万 \n" +
                "G级 ]SUV] 169.8万-225.8万 \n" +
                "GL级 ]SUV] 113.0万-159.8万 \n" +
                "GLK级（进口） ]SUV] 44.8万-72.8万 \n" +
                "ML级 ]SUV] 76.0万-141.8万 \n" +
                "ML63 AMG ]SUV] 195.8万-195.8万 \n" +
                "R级 ]MPV] 69.8万-124.8万 \n" +
                "S级 AMG ]豪华车] 329.8万-329.8万 \n" +
                "S级 ]豪华车] 93.0万-259.8万 \n" +
                "S级混合动力 ]豪华车] 145.8万-145.8万 \n" +
                "SL级 ]跑车] 119.8万-199.8万 \n" +
                "SL级AMG ]跑车] 256.8万-256.8万 \n" +
                "SLK55 AMG ]跑车] 129.9万-129.9万 \n" +
                "SLS AMG ]跑车] 362.8万-362.8万 \n" +
                "\n" +
                "Cross POLO ]小型车] 10.6万-12.59万 \n" +
                "朗逸 ]紧凑型车] 11.28万-16.28万 \n" +
                "帕萨特领驭 ]中型车] 16.98万-30.38万 \n" +
                "Polo ]小型车] 8.59万-12.39万 \n" +
                "Polo Sporty ]小型车] 9.6万-10.8万 \n" +
                "Polo劲取 ]小型车] 8.58万-11.28万 \n" +
                "帕萨特 ]中型车] 19.48万-32.28万 \n" +
                "桑塔纳 ]中型车] 7.58万-7.58万 \n" +
                "桑塔纳志俊 ]中型车] 8.98万-12.48万 \n" +
                "途安 ]MPV] 14.98万-20.08万 \n" +
                "途观 ]SUV] 18.98万-30.98万 \n" +
                "\n" +
                "宝来 ]紧凑型车] 10.78万-14.68万 \n" +
                "CC ]中型车] 25.28万-34.98万 \n" +
                "高尔夫 ]紧凑型车] 11.89万-16.78万 \n" +
                "高尔夫GTI ]紧凑型车] 23.58万-23.58万 \n" +
                "捷达 ]紧凑型车] 7.58万-9.88万 \n" +
                "迈腾 ]中型车] 19.98万-33.48万 \n" +
                "速腾 ]紧凑型车] 13.18万-18.58万 \n" +
                "CC(进口) ]中型车] 50.5万-53.68万 \n" +
                "CrossGolf ]紧凑型车] 28.33万-28.33万 \n" +
                "Eos ]紧凑型车] 41.0万-46.85万 \n" +
                "高尔夫R ]跑车] 39.8万-39.8万 \n" +
                "高尔夫敞篷 ]紧凑型车] 34.98万-37.98万 \n" +
                "Golf Variant ]紧凑型车] 23.98万-28.98万 \n" +
                "辉腾 ]豪华车] 75.88万-253.18万 \n" +
                "甲壳虫 ]紧凑型车] 20.16万-30.21万 \n" +
                "甲壳虫敞篷 ]紧凑型车] 29.5万-30.21万 \n" +
                "旅行车 ]中型车] 34.0万-37.15万 \n" +
                "迈腾旅行车 ]中型车] 32.48万-37.48万 \n" +
                "R36 ]中型车] 49.2万-52.8万 \n" +
                "尚酷 ]跑车] 23.58万-36.02万 \n" +
                "尚酷R ]紧凑型车] 39.88万-39.88万 \n" +
                "T5 ]MPV] 43.8万-56.8万 \n" +
                "Tiguan ]SUV] 34.25万-41.28万 \n" +
                "途锐 ]SUV] 78.0万-109.34万 \n" +
                "夏朗 ]MPV] 30.98万-40.98万 \n" +
                "\n" +
                "57 ]豪华车] 538.0万-538.0万 \n" +
                "62 ]豪华车] 618.0万-618.0万 \n" +
                "\n" +
                "MINI ]小型车] 22.5万-35.9万 \n" +
                "CLUBMAN ]小型车] 24.5万-37.9万 \n" +
                "COUNTRYMAN ]SUV] 28.8万-41.5万 \n" +
                "COUPE ]小型车] 31.8万-38.5万 \n" +
                "ROADSTER ]小型车] 37.6万-43.3万 \n" +
                "CABRIO ]小型车] 35.5万-41.5万 \n" +
                "\n" +
                "晶锐 ]小型车] 7.89万-11.46万 \n" +
                "晶锐跨界版 ]小型车] 11.59万-11.59万 \n" +
                "明锐 ]紧凑型车] 12.34万-18.05万 \n" +
                "明锐RS ]紧凑型车] 21.09万-21.09万 \n" +
                "昊锐 ]中型车] 17.19万-27.13万 \n" +
                "\n" +
                "fortwo ]微型车] 11.5万-22.5万 \n" +
                "\n" +
                "MF4 ]跑车] 280.0万-280.0万 \n" +
                "MF5 ]跑车] 380.0万-380.0万 \n" +
                "\n" +
                "GL8 ]MPV] 22.8万-38.8万 \n" +
                "君威 ]中型车] 18.59万-25.99万 \n" +
                "君威GS ]中型车] 28.39万-28.39万 \n" +
                "君越 ]中型车] 22.69万-32.29万 \n" +
                "君越混合动力 ]其它] 26.49万-28.49万 \n" +
                "凯越 ]紧凑型车] 9.99万-11.79万 \n" +
                "林荫大道 ]中大型车] 32.99万-42.99万 \n" +
                "英朗GT ]紧凑型车] 13.27万-18.97万 \n" +
                "英朗XT ]紧凑型车] 12.99万-18.69万 \n" +
                "昂科雷 ]SUV] 52.9万-59.9万 \n" +
                "\n" +
                "福克斯两厢 ]紧凑型车] 9.98万-16.29万 \n" +
                "福克斯三厢 ]紧凑型车] 9.98万-16.99万 \n" +
                "嘉年华两厢 ]小型车] 7.99万-11.29万 \n" +
                "嘉年华三厢 ]小型车] 7.99万-11.19万 \n" +
                "麦柯斯S-MAX ]MPV] 19.48万-24.58万 \n" +
                "蒙迪欧致胜 ]中型车] 16.98万-25.68万 \n" +
                "翼虎 ]SUV] 26.8万-26.8万 \n" +
                "F-150 ]其它] 78.0万-98.0万 \n" +
                "锐界 ]SUV] 36.98万-42.98万 \n" +
                "野马 ]跑车] 56.8万-138.8万 \n" +
                "\n" +
                "H3 ]SUV] 80.0万-80.0万 \n" +
                "\n" +
                "大切诺基 ]SUV] 57.59万-119.99万 \n" +
                "牧马人两门版 ]SUV] 44.99万-50.99万 \n" +
                "牧马人四门版 ]SUV] 47.99万-54.99万 \n" +
                "指挥官 ]SUV] 61.99万-64.99万 \n" +
                "指南者 ]SUV] 22.19万-27.29万 \n" +
                "自由客 ]SUV] 23.89万-27.89万 \n" +
                "\n" +
                "SLS赛威 ]中大型车] 38.88万-52.8万 \n" +
                "CTS ]中型车] 36.98万-48.8万 \n" +
                "CTS Coupe ]中型车] 64.8万-64.8万 \n" +
                "CTS-V ]跑车] 110.0万-110.0万 \n" +
                "凯雷德混动 ]其它] 158.8万-158.8万 \n" +
                "SRX ]SUV] 42.98万-57.8万 \n" +
                "XLR ]跑车] 152.0万-152.0万 \n" +
                "\n" +
                "大捷龙 ]MPV] 31.9万-35.9万 \n" +
                "PT漫步者 ]紧凑型车] 23.99万-23.99万 \n" +
                "\n" +
                "领航员 ]SUV] 135.0万-185.0万 \n" +
                "MKS ]中大型车] 109.8万-109.8万 \n" +
                "MKT ]SUV] 119.8万-119.8万 \n" +
                "MKX ]SUV] 88.0万-88.0万 \n" +
                "MKZ ]中大型车] 80.8万-80.8万 \n" +
                "\n" +
                "安德拉 ]SUV] 26.6万-30.8万 \n" +
                "赛飞利 ]MPV] 25.8万-26.9万 \n" +
                "雅特 ]紧凑型车] 22.5万-28.0万 \n" +
                "雅特A+ ]紧凑型车] 25.8万-27.7万 \n" +
                "雅特敞篷 ]跑车] 36.98万-36.98万 \n" +
                "\n" +
                "爱唯欧两厢 ]小型车] 8.18万-11.18万 \n" +
                "爱唯欧三厢 ]小型车] 8.18万-11.18万 \n" +
                "景程 ]中型车] 10.88万-16.19万 \n" +
                "科鲁兹 ]紧凑型车] 10.89万-15.99万 \n" +
                "科帕奇 ]SUV] 21.98万-22.58万 \n" +
                "乐骋 ]小型车] 6.99万-6.99万 \n" +
                "乐风 ]小型车] 8.19万-10.19万 \n" +
                "迈锐宝 ]中型车] 16.29万-22.99万 \n" +
                "赛欧两厢 ]小型车] 5.68万-7.93万 \n" +
                "赛欧三厢 ]小型车] 5.68万-7.93万 \n" +
                "Camaro科迈罗 ]跑车] 45.58万-47.58万 \n" +
                "科帕奇(进口) ]SUV] 25.28万-26.38万 \n" +
                "斯帕可 ]微型车] 7.78万-8.88万 \n" +
                "Volt沃蓝达 ]其它] 49.8万-49.8万 \n" +
                "\n" +
                "207两厢 ]小型车] 7.18万-10.28万 \n" +
                "207三厢 ]小型车] 7.48万-10.58万 \n" +
                "307两厢 ]紧凑型车] 9.28万-14.28万 \n" +
                "307三厢 ]紧凑型车] 9.28万-13.28万 \n" +
                "308 ]紧凑型车] 10.39万-14.19万 \n" +
                "408 ]紧凑型车] 12.19万-16.99万 \n" +
                "508 ]中型车] 16.97万-22.97万 \n" +
                "Cross 307 ]紧凑型车] 9.78万-11.08万 \n" +
                "207CC ]跑车] 22.68万-22.68万 \n" +
                "3008 ]SUV] 24.68万-26.68万 \n" +
                "308CC ]跑车] 30.48万-33.88万 \n" +
                "308SW ]紧凑型车] 22.88万-26.38万 \n" +
                "407 ]中型车] 30.48万-42.53万 \n" +
                "407Coupe ]跑车] 49.0万-49.0万 \n" +
                "407SW ]中型车] 37.98万-37.98万 \n" +
                "607 ]中大型车] 47.0万-47.0万 \n" +
                "4008 ]SUV] 21.98万-27.98万 \n" +
                "RCZ ]跑车] 32.88万-35.68万 \n" +
                "\n" +
                "风景 ]MPV] 21.28万-25.48万 \n" +
                "风朗 ]紧凑型车] 16.58万-19.58万 \n" +
                "科雷傲 ]SUV] 22.98万-29.68万 \n" +
                "拉古那 ]中型车] 24.98万-28.38万 \n" +
                "拉古那-古贝 ]中型车] 35.98万-35.98万 \n" +
                "梅甘娜 ]紧凑型车] 21.5万-21.5万 \n" +
                "梅甘娜CC ]跑车] 38.58万-38.58万 \n" +
                "塔利斯曼 ]中大型车] 31.88万-48.48万 \n" +
                "纬度 ]中型车] 23.98万-29.28万 \n" +
                "\n" +
                "爱丽舍两厢 ]紧凑型车] 7.38万-8.48万 \n" +
                "爱丽舍三厢 ]紧凑型车] 7.38万-8.88万 \n" +
                "C2 ]小型车] 7.18万-8.98万 \n" +
                "C5 ]中型车] 17.69万-29.89万 \n" +
                "凯旋 ]中型车] 14.98万-17.28万 \n" +
                "萨拉毕加索 ]MPV] 12.58万-15.78万 \n" +
                "世嘉两厢 ]紧凑型车] 10.68万-14.78万 \n" +
                "世嘉三厢 ]紧凑型车] 10.68万-14.98万 \n" +
                "C4 ]紧凑型车] 19.98万-22.98万 \n" +
                "C4 Aircross ]SUV] 21.98万-27.98万 \n" +
                "C6 ]中大型车] 63.98万-63.98万 \n" +
                "大C4毕加索 ]MPV] 27.68万-30.68万 \n" +
                "\n" +
                "威航 ]跑车] 2500.0万-4300.0万 \n" +
                "\n" +
                "458 ]跑车] 388.8万-388.8万 \n" +
                "599 ]跑车] 492.8万-492.8万 \n" +
                "612-OTO ]跑车] 569.8万-569.8万 \n" +
                "California ]跑车] 348.8万-348.8万 \n" +
                "FF ]跑车] 530.8万-530.8万 \n" +
                "\n" +
                "500 ]小型车] 16.98万-26.88万 \n" +
                "500敞篷版 ]小型车] 20.98万-26.18万 \n" +
                "博悦 ]紧凑型车] 16.39万-20.79万 \n" +
                "菲跃 ]SUV] 24.98万-27.48万 \n" +
                "领雅 ]紧凑型车] 17.1万-18.6万 \n" +
                "朋多 ]小型车] 14.88万-16.66万 \n" +
                "\n" +
                "Aventador ]跑车] 648.8万-648.8万 \n" +
                "盖拉多 ]跑车] 298.0万-490.0万 \n" +
                "蝙蝠 ]跑车] 438.0万-730.0万\n" +
                "\n" +
                "GranCabrio ]跑车] 268.8万-278.8万 \n" +
                "GT ]跑车] 219.8万-237.8万 \n" +
                "总裁 ]豪华车] 173.0万-247.8万 \n" +
                "\n" +
                "奥德赛 ]MPV] 22.98万-28.28万 \n" +
                "飞度 ]小型车] 7.98万-11.98万 \n" +
                "锋范 ]紧凑型车] 9.68万-15.98万 \n" +
                "歌诗图 ]SUV] 25.98万-42.88万 \n" +
                "雅阁 ]中型车] 18.68万-34.28万 \n" +
                "CR-V ]SUV] 19.38万-26.28万 \n" +
                "思铂睿 ]中型车] 23.78万-27.18万 \n" +
                "思域 ]紧凑型车] 13.18万-18.58万 \n" +
                "思域混合动力 ]其它] 26.98万-26.98万 \n" +
                "\n" +
                "花冠EX ]紧凑型车] 9.28万-11.48万 \n" +
                "皇冠 ]中大型车] 32.85万-89.96万 \n" +
                "卡罗拉 ]紧凑型车] 12.38万-19.98万 \n" +
                "兰德酷路泽 ]SUV] 76.5万-115.9万 \n" +
                "普锐斯 ]其它] 22.98万-26.98万 \n" +
                "RAV4 ]SUV] 18.78万-26.98万 \n" +
                "锐志 ]中型车] 20.98万-32.68万 \n" +
                "威驰 ]小型车] 8.95万-12.39万 \n" +
                "汉兰达 ]SUV] 24.88万-42.98万 \n" +
                "凯美瑞 ]中型车] 17.98万-27.48万 \n" +
                "凯美瑞尊瑞混动 ]其它] 25.98万-32.98万 \n" +
                "雅力士 ]小型车] 8.7万-10.68万 \n" +
                "逸致 ]MPV] 14.98万-23.98万 \n" +
                "埃尔法 ]MPV] 61.44万-74.88万 \n" +
                "FJ酷路泽 ]SUV] 54.3万-54.3万 \n" +
                "海狮 ]MPV] 39.1万-50.3万 \n" +
                "普拉多 ]SUV] 43.7万-69.8万 \n" +
                "普瑞维亚 ]MPV] 46.98万-61.1万 \n" +
                "ZELAS杰路驰 ]紧凑型车] 25.5万-28.0万 \n" +
                "\n" +
                "CT200h ]紧凑型车] 27.9万-44.5万 \n" +
                "ES ]中型车] 39.0万-65.1万 \n" +
                "GS ]中大型车] 52.7万-103.4万 \n" +
                "GS混动 ]其它] 94.1万-94.1万 \n" +
                "GX ]SUV] 116.0万-116.0万 \n" +
                "IS ]中型车] 34.5万-64.5万 \n" +
                "IS敞篷 ]跑车] 64.5万-64.5万 \n" +
                "LF-A ]跑车] 598.8万-598.8万 \n" +
                "LS ]豪华车] 139.8万-156.8万 \n" +
                "LS混动 ]其它] 207.3万-207.3万 \n" +
                "LX ]SUV] 173.3万-173.3万 \n" +
                "RX ]SUV] 49.5万-94.5万 \n" +
                "RX混动 ]其它] 95.4万-95.4万 \n" +
                "SC ]跑车] 132.0万-132.0万 \n" +
                "\n" +
                "奥拓 ]微型车] 4.49万-6.29万 \n" +
                "羚羊 ]小型车] 4.18万-5.28万 \n" +
                "天语尚悦 ]紧凑型车] 7.98万-12.38万 \n" +
                "天语SX4 ]紧凑型车] 8.58万-13.48万 \n" +
                "雨燕 ]小型车] 5.98万-9.38万 \n" +
                "北斗星 ]微型车] 3.68万-5.57万 \n" +
                "北斗星e+ ]微型车] 5.03万-5.8万 \n" +
                "浪迪 ]其它] 4.98万-5.35万 \n" +
                "利亚纳两厢 ]紧凑型车] 6.28万-10.66万 \n" +
                "利亚纳三厢 ]小型车] 6.28万-10.66万 \n" +
                "派喜 ]小型车] 5.49万-6.19万 \n" +
                "超级维特拉 ]SUV] 24.2万-27.2万 \n" +
                "吉姆尼 ]SUV] 13.9万-15.8万 \n" +
                "凯泽西 ]中型车] 18.88万-24.88万 \n" +
                "\n" +
                "Mazda8 ]MPV] 21.98万-24.98万 \n" +
                "Mazda6 ]中型车] 17.08万-19.98万 \n" +
                "睿翼 ]中型车] 17.68万-24.98万 \n" +
                "睿翼轿跑车 ]中型车] 19.18万-23.98万 \n" +
                "2 ]小型车] 8.08万-10.53万 \n" +
                "2劲翔 ]小型车] 8.18万-10.58万 \n" +
                "3经典 ]紧凑型车] 9.68万-14.98万 \n" +
                "3星骋 ]紧凑型车] 11.28万-15.38万 \n" +
                "3星骋两厢 ]紧凑型车] 11.28万-14.98万 \n" +
                "CX-7 ]SUV] 29.08万-29.08万 \n" +
                "Mazda5 ]MPV] 16.48万-19.18万 \n" +
                "MX-5 ]跑车] 29.98万-29.98万 \n" +
                "\n" +
                "MDX ]SUV] 81.0万-94.0万 \n" +
                "RL ]中大型车] 68.0万-82.0万 \n" +
                "TL ]中型车] 49.8万-49.8万 \n" +
                "ZDX ]中大型车] 88.8万-88.8万 \n" +
                "\n" +
                "楼兰 ]SUV] 48.88万-48.88万 \n" +
                "玛驰 ]小型车] 6.99万-9.29万 \n" +
                "奇骏 ]SUV] 20.78万-26.98万 \n" +
                "天籁 ]中型车] 19.08万-37.18万 \n" +
                "逍客 ]SUV] 13.98万-21.98万 \n" +
                "轩逸 ]紧凑型车] 12.48万-16.78万 \n" +
                "阳光 ]紧凑型车] 8.28万-11.28万 \n" +
                "颐达 ]紧凑型车] 10.68万-14.98万 \n" +
                "骐达 ]紧凑型车] 10.53万-15.68万 \n" +
                "骊威 ]紧凑型车] 8.58万-12.98万 \n" +
                "奥丁 ]SUV] 11.98万-15.48万 \n" +
                "D22 ]其它] 13.38万-18.88万 \n" +
                "凯普斯达 ]其它] 13.98万-15.28万 \n" +
                "NV200 ]MPV] 7.98万-12.78万 \n" +
                "帕拉丁 ]SUV] 16.48万-24.98万 \n" +
                "帕拉骐 ]其它] 14.98万-19.38万 \n" +
                "锐骐多功能商用车 ]其它] 10.18万-13.98万 \n" +
                "锐骐皮卡 ]其它] 7.98万-12.48万 \n" +
                "帅客 ]MPV] 6.58万-11.58万 \n" +
                "途乐 ]SUV] 139.0万-139.0万 \n" +
                "御轩 ]MPV] 13.28万-19.28万 \n" +
                "ZN6493 ]其它] 14.68万-18.88万 \n" +
                "370Z ]跑车] 63.98万-63.98万 \n" +
                "GT-R ]跑车] 150.5万-150.5万 \n" +
                "贵士 ]MPV] 66.8万-66.8万 \n" +
                "\n" +
                "戈蓝 ]中型车] 14.98万-19.98万 \n" +
                "君阁 ]SUV] 12.98万-17.48万 \n" +
                "蓝瑟 ]紧凑型车] 8.58万-10.48万 \n" +
                "蓝瑟EX ]紧凑型车] 21.8万-28.5万 \n" +
                "翼神 ]紧凑型车] 11.68万-16.98万 \n" +
                "帕杰罗 ]SUV] 29.8万-39.86万 \n" +
                "格蓝迪 ]MPV] 27.8万-31.8万 \n" +
                "帕杰罗劲畅 ]SUV] 36.8万-39.8万 \n" +
                "劲炫（进口） ]SUV] 19.8万-25.5万 \n" +
                "蓝瑟 翼豪陆神 ]跑车] 49.8万-50.8万 \n" +
                "欧蓝德劲界 ]SUV] 24.9万-37.4万 \n" +
                "帕杰罗长轴 ]SUV] 43.5万-62.0万 \n" +
                "帕杰罗短轴 ]SUV] 58.0万-58.0万 \n" +
                "伊柯丽斯 ]跑车] 29.8万-33.8万 \n" +
                "\n" +
                "傲虎 ]中型车] 29.98万-42.98万 \n" +
                "驰鹏 ]SUV] 58.78万-58.78万 \n" +
                "力狮 ]中型车] 25.48万-37.98万 \n" +
                "力狮wagon ]中型车] 26.48万-28.48万 \n" +
                "森林人 ]SUV] 22.98万-36.98万 \n" +
                "XV ]SUV] 19.98万-23.28万 \n" +
                "翼豹两厢 ]紧凑型车] 20.48万-49.8万 \n" +
                "翼豹三厢 ]紧凑型车] 20.98万-33.98万 \n" +
                "\n" +
                "EX ]中型车] 49.8万-65.5万 \n" +
                "FX ]SUV] 78.3万-120.8万 \n" +
                "G ]中型车] 38.8万-49.1万 \n" +
                "G级敞篷 ]跑车] 73.41万-75.41万 \n" +
                "G级双门 ]跑车] 66.21万-66.21万 \n" +
                "M ]中大型车] 49.8万-65.8万 \n" +
                "QX ]SUV] 149.8万-149.8万 \n" +
                "\n" +
                "福瑞迪 ]紧凑型车] 9.88万-13.98万 \n" +
                "嘉华 ]MPV] 19.58万-24.98万 \n" +
                "K5 ]中型车] 15.98万-24.98万 \n" +
                "K2三厢 ]小型车] 7.29万-10.99万 \n" +
                "K2两厢 ]小型车] 7.29万-9.99万 \n" +
                "RIO ]小型车] 6.98万-10.48万 \n" +
                "赛拉图 ]紧凑型车] 8.98万-13.38万 \n" +
                "赛拉图欧风 ]紧凑型车] 8.88万-11.38万 \n" +
                "狮跑 ]SUV] 15.98万-19.68万 \n" +
                "秀尔 ]紧凑型车] 10.38万-12.78万 \n" +
                "智跑 ]SUV] 16.48万-24.98万 \n" +
                "霸锐 ]SUV] 39.8万-39.8万 \n" +
                "新佳乐 ]MPV] 12.46万-17.98万 \n" +
                "凯尊 ]中大型车] 23.5万-29.9万 \n" +
                "欧菲莱斯 ]中大型车] 23.9万-30.8万 \n" +
                "速迈 ]跑车] 17.18万-20.08万 \n" +
                "索兰托 ]SUV] 22.98万-27.28万 \n" +
                "VQ威客 ]MPV] 27.5万-29.8万 \n" +
                "\n" +
                "爱腾 ]SUV] 16.98万-24.48万 \n" +
                "雷斯特 ]SUV] 24.98万-38.68万 \n" +
                "路帝 ]MPV] 26.98万-33.98万 \n" +
                "柯兰多 ]SUV] 17.98万-25.98万 \n" +
                "享御 ]SUV] 21.98万-25.98万 \n" +
                "主席 ]中大型车] 41.8万-69.8万\n" +
                "\n" +
                "i30 ]紧凑型车] 9.98万-14.18万 \n" +
                "ix35 ]SUV] 16.98万-24.28万 \n" +
                "名驭 ]中型车] 11.48万-13.98万 \n" +
                "瑞纳两厢 ]小型车] 7.39万-10.69万 \n" +
                "索纳塔八 ]中型车] 16.69万-24.99万 \n" +
                "途胜 ]SUV] 16.58万-24.18万 \n" +
                "瑞纳三厢 ]小型车] 7.39万-10.69万 \n" +
                "雅绅特 ]小型车] 7.18万-9.78万 \n" +
                "伊兰特 ]紧凑型车] 8.98万-10.38万 \n" +
                "悦动 ]紧凑型车] 9.98万-14.68万 \n" +
                "飞思Veloster ]跑车] 14.98万-20.58万 \n" +
                "劳恩斯 ]中大型车] 39.0万-57.5万 \n" +
                "劳恩斯-酷派 ]跑车] 19.9万-32.5万 \n" +
                "维拉克斯 ]SUV] 39.8万-43.68万 \n" +
                "新胜达 ]SUV] 22.86万-28.68万 \n" +
                "雅科仕 ]豪华车] 69.9万-125.0万 \n" +
                "雅尊 ]中型车] 23.8万-32.8万 \n" +
                "\n" +
                "DB9 ]跑车] 281.0万-281.0万 \n" +
                "DB9 敞篷 ]跑车] 304.0万-304.0万 \n" +
                "DBS ]跑车] 410.0万-410.0万 \n" +
                "Rapide ]跑车] 368.8万-368.8万 \n" +
                "V8 Vantage ]跑车] 239.0万-318.0万 \n" +
                "V8 VR ]跑车] 249.0万-249.0万 \n" +
                "Virage ]跑车] 438.0万-456.0万 \n" +
                "\n" +
                "慕尚 ]豪华车] 568.0万-928.0万 \n" +
                "欧陆 ]跑车] 338.0万-518.0万 \n" +
                "雅致 ]豪华车] 498.0万-808.0万 \n" +
                "\n" +
                "XF ]中大型车] 63.8万-69.8万 \n" +
                "XJ ]豪华车] 96.8万-254.8万 \n" +
                "XK ]跑车] 203.0万-251.8万 \n" +
                "\n" +
                "古思特 ]豪华车] 399.0万-399.0万 \n" +
                "幻影 ]豪华车] 668.0万-718.0万 \n" +
                "\n" +
                "发现4 ]SUV] 82.8万-118.8万 \n" +
                "揽胜 ]SUV]149.8万-268.8万 \n" +
                "揽胜极光 ]SUV]62.8万-63.8万 \n" +
                "揽胜运动版 ]SUV]92.8万-183.8万 \n" +
                "神行者2 ]SUV] 39.8万-65.8万 \n" +
                "卫士 ]SUV] 74.8万-74.8万 \n" +
                "\n" +
                "爱丽丝 ]跑车] 69.8万-86.8万 \n" +
                "Evora ]跑车]124.8万-368.0万 \n" +
                "Exige ]跑车] 89.8万-99.8万 \n" +
                "\n" +
                "3 ]小型车] 6.97万-10.37万 \n" +
                "6 ]紧凑型车] 12.68万-19.28万 \n" +
                "7 ]中型车] 15.68万-30.28万 \n" +
                "5 ]紧凑型车] 8.77万-12.87万 \n" +
                "6 Saloon ]紧凑型车] 12.78万-18.98万 \n" +
                "TF ]跑车]24.96万-26.58万\n" +
                "\n" +
                "e6先行者 ]其它] 36.98万-36.98万 \n" +
                "S6 ]SUV] 8.99万-13.09万 \n" +
                "F0 ]微型车] 3.69万-4.69万 \n" +
                "F3 ]紧凑型车] 5.29万-6.69万 \n" +
                "F3DM ]其它] 16.98万-16.98万 \n" +
                "F3R ]紧凑型车] 5.39万-6.99万 \n" +
                "F6 ]中型车] 8.98万-10.98万 \n" +
                "G3 ]紧凑型车] 6.29万-7.89万 \n" +
                "G3R ]紧凑型车] 5.99万-7.39万 \n" +
                "G6 ]中型车] 7.98万-11.58万 \n" +
                "L3 ]紧凑型车] 5.99万-8.29万 \n" +
                "M6 ]MPV] 15.08万-23.98万 \n" +
                "S8 ]跑车] 16.58万-20.68万 \n" +
                "\n" +
                "奔奔i ]微型车] 3.69万-5.88万 \n" +
                "奔奔love ]微型车] 3.89万-5.89万 \n" +
                "奔奔mini ]微型车] 3.69万-4.89万 \n" +
                "逸动 ]紧凑型车] 7.39万-9.49万 \n" +
                "CM8 ]其它] 4.88万-6.88万 \n" +
                "CX20 ]小型车] 4.99万-7.09万 \n" +
                "CX30三厢 ]紧凑型车] 6.38万-7.28万 \n" +
                "杰勋 ]MPV] 10.48万-14.98万 \n" +
                "杰勋HEV ]其它] 13.98万-14.98万 \n" +
                "悦翔两厢 ]小型车] 5.59万-7.19万 \n" +
                "悦翔三厢 ]小型车] 5.49万-7.29万 \n" +
                "志翔 ]紧凑型车] 7.98万-11.58万 \n" +
                "\n" +
                "长安之星 ]其它] 3.49万-4.24万 \n" +
                "金牛星 ]其它] 4.59万-5.59万 \n" +
                "长安欧诺 ]MPV] 4.49万-6.09万\n" +
                "\n" +
                "腾翼C20R ]紧凑型车] 6.29万-7.29万 \n" +
                "C50 ]紧凑型车] 7.8万-9.18万 \n" +
                "风骏 ]其它] 7.78万-10.98万 \n" +
                "哈弗H3 ]SUV] 9.28万-15.88万 \n" +
                "哈弗H5 ]SUV] 9.28万-17.08万 \n" +
                "哈弗H6 ]SUV] 9.58万-14.18万 \n" +
                "哈弗M1 ]SUV] 4.29万-5.69万 \n" +
                "哈弗M2 ]SUV] 6.79万-8.99万 \n" +
                "哈弗 派 ]SUV] 31.88万-31.88万 \n" +
                "金迪尔 ]其它] 6.28万-7.18万 \n" +
                "精灵 ]微型车] 3.69万-4.49万 \n" +
                "精灵Cross ]微型车] 4.19万-4.59万 \n" +
                "酷熊 ]小型车] 6.39万-8.79万 \n" +
                "凌傲 ]小型车] 5.49万-8.09万 \n" +
                "赛酷 ]其它] 6.58万-8.08万 \n" +
                "赛铃 ]其它] 6.98万-9.18万 \n" +
                "腾翼C30 ]紧凑型车] 6.45万-8.35万 \n" +
                "腾翼V80 ]MPV] 6.98万-11.48万 \n" +
                "炫丽Cross ]小型车] 6.09万-6.69万 \n" +
                "炫丽 ]小型车] 5.99万-6.39万 \n" +
                "\n" +
                "DUV ]SUV] 13.98万-16.98万 \n" +
                "飞扬 ]其它] 6.88万-9.98万 \n" +
                "骐菱 ]MPV] 6.98万-8.68万 \n" +
                "\n" +
                "EC7 ]紧凑型车] 6.98万-10.98万 \n" +
                "EC7-RV ]紧凑型车] 6.68万-10.58万 \n" +
                "EC8 ]中型车] 10.58万-15.98万 \n" +
                "\n" +
                "景逸 ]紧凑型车] 5.99万-10.99万 \n" +
                "景逸LV ]紧凑型车] 6.89万-10.59万 \n" +
                "景逸SUV ]SUV] 8.09万-9.89万 \n" +
                "菱智 ]MPV] 5.68万-14.88万 \n" +
                "\n" +
                "得利卡 ]其它] 6.78万-14.78万 \n" +
                "菱悦 ]紧凑型车] 5.78万-8.89万 \n" +
                "希旺 ]其它] 3.68万-4.98万 \n" +
                "\n" +
                "A60 ]紧凑型车] 11.88万-13.98万 \n" +
                "H30 ]紧凑型车] 6.98万-9.38万 \n" +
                "H30 Cross ]紧凑型车] 7.58万-9.18万 \n" +
                "S30 ]紧凑型车] 6.98万-9.38万 \n" +
                "\n" +
                "传祺 ]中型车] 10.98万-18.98万 \n" +
                "传祺GS5 ]SUV] 12.38万-22.98万 \n" +
                "\n" +
                "骏意 ]其它] 4.13万-4.48万 \n" +
                "路宝 ]微型车] 3.38万-5.28万 \n" +
                "路尊大霸王 ]其它] 5.09万-6.08万 \n" +
                "路尊小霸王 ]其它] 2.98万-4.2万 \n" +
                "民意 ]其它] 2.75万-4.63万 \n" +
                "赛豹V系 ]紧凑型车] 8.38万-9.98万 \n" +
                "赛豹Ⅲ系 ]紧凑型车] 6.4万-8.58万 \n" +
                "赛马 ]小型车] 5.48万-6.28万 \n" +
                "中意 ]其它] 3.1万-3.29万 \n" +
                "\n" +
                "爱尚 ]微型车] 3.78万-4.58万 \n" +
                "福美来 ]紧凑型车] 7.68万-9.88万 \n" +
                "福美来VS ]紧凑型车] 7.68万-9.88万 \n" +
                "福仕达 ]微型车] 2.98万-4.38万 \n" +
                "海福星 ]紧凑型车] 6.18万-6.88万 \n" +
                "欢动 ]紧凑型车] 8.36万-10.26万 \n" +
                "普力马 ]MPV] 7.98万-10.98万 \n" +
                "骑士 ]SUV] 11.38万-15.28万 \n" +
                "丘比特 ]小型车] 5.39万-6.89万 \n" +
                "王子 ]微型车] 2.98万-4.38万 \n" +
                "\n" +
                "盛世 ]中大型车] 34.98万-68.88万 \n" +
                "\n" +
                "海锋 ]紧凑型车] 5.89万-6.19万 \n" +
                "海尚 ]紧凑型车] 5.29万-7.19万 \n" +
                "海迅两厢 ]紧凑型车] 5.19万-5.99万 \n" +
                "海迅三厢 ]紧凑型车] 5.39万-6.99万 \n" +
                "海域两厢 ]紧凑型车] 3.99万-4.49万 \n" +
                "海域三厢 ]紧凑型车] 4.89万-5.29万 \n" +
                "\n" +
                "伊思坦纳 ]其它] 16.38万-22.68万 \n" +
                "\n" +
                "宾悦 ]中型车] 9.18万-13.98万 \n" +
                "和悦 ]紧凑型车] 6.18万-8.68万 \n" +
                "和悦RS ]MPV] 6.28万-8.68万 \n" +
                "瑞风 ]MPV] 9.99万-16.38万 \n" +
                "瑞风II ]MPV] 15.98万-18.68万 \n" +
                "瑞鹰 ]SUV] 7.98万-13.68万 \n" +
                "同悦 ]小型车] 4.88万-5.68万 \n" +
                "同悦CROSS ]小型车] 5.38万-6.08万 \n" +
                "同悦RS ]小型车] 4.88万-5.68万 \n" +
                "悦悦 ]微型车] 4.08万-4.38万 \n" +
                "\n" +
                "驭胜 ]SUV] 14.68万-18.68万 \n" +
                "全顺 ]其它] 11.5万-16.58万 \n" +
                "\n" +
                "奥轩G3 ]SUV] 8.98万-8.98万 \n" +
                "奥轩G5 ]SUV] 9.68万-13.08万 \n" +
                "奥轩GX5 ]中型车] 13.58万-15.18万 \n" +
                "帅豹 ]SUV] 11.98万-14.38万 \n" +
                "帅舰 ]SUV] 7.08万-8.58万 \n" +
                "星旺 ]其它] 2.59万-3.2万 \n" +
                "\n" +
                "大海狮 ]其它] 13.98万-19.98万 \n" +
                "阁瑞斯 ]MPV] 13.78万-24.98万 \n" +
                "海狮 ]其它] 6.18万-14.88万 \n" +
                "S50 ]SUV] 8.83万-13.28万 \n" +
                "\n" +
                "优劲 ]其它] 3.18万-3.68万 \n" +
                "优派 ]其它] 3.48万-4.28万 \n" +
                "优胜 ]其它] 3.38万-4.23万 \n" +
                "优胜二代 ]微型车] 3.38万-4.23万 \n" +
                "优雅 ]其它] 4.18万-5.68万 \n" +
                "优翼 ]其它] 5.58万-6.08万 \n" +
                "优优 ]其它] 3.69万-5.39万\n" +
                "\n" +
                "CS6 ]SUV] 14.68万-22.68万 \n" +
                "飞腾时尚 ]SUV] 7.98万-12.38万 \n" +
                "飞腾经典 ]SUV] 9.48万-12.68万 \n" +
                "黑金刚 ]SUV] 14.68万-17.98万 \n" +
                "奇兵 ]SUV] 10.18万-12.68万 \n" +
                "\n" +
                "320 ]微型车] 3.65万-5.49万 \n" +
                "520 ]紧凑型车] 4.39万-5.19万 \n" +
                "520i ]紧凑型车] 3.99万-4.19万 \n" +
                "620 ]紧凑型车] 5.69万-7.89万 \n" +
                "X60 ]SUV] 8.0万-8.69万 \n" +
                "\n" +
                "S1 ]小型车] 6.98万-9.98万 \n" +
                "\n" +
                "风尚 ]MPV] 7.83万-10.93万 \n" +
                "X6 ]SUV] 7.98万-11.78万 \n" +
                "X8 ]SUV] 9.99万-18.18万 \n" +
                "X9 ]SUV] 11.15万-16.28万 \n" +
                "\n" +
                "大7 SUV ]SUV] 18.8万-26.8万 \n" +
                "\n" +
                "D50 ]紧凑型车] 6.78万-8.38万 \n" +
                "\n" +
                "A3两厢 ]紧凑型车] 7.58万-9.58万 \n" +
                "A3三厢 ]紧凑型车] 7.78万-10.08万 \n" +
                "东方之子 ]中型车] 9.58万-13.58万 \n" +
                "E5 ]紧凑型车] 5.98万-8.18万 \n" +
                "风云2两厢 ]小型车] 5.18万-6.08万 \n" +
                "风云2三厢 ]小型车] 5.28万-6.18万 \n" +
                "A1 ]小型车] 3.68万-5.68万 \n" +
                "旗云1 ]微型车] 3.99万-5.49万 \n" +
                "旗云2 ]小型车] 4.78万-5.98万 \n" +
                "旗云3 ]紧凑型车] 5.78万-9.38万 \n" +
                "旗云5 ]中型车] 7.58万-10.18万 \n" +
                "QQ3 ]微型车] 3.09万-5.09万 \n" +
                "QQme ]微型车] 5.5万-6.9万 \n" +
                "瑞虎 ]SUV] 8.48万-11.58万 \n" +
                "瑞虎DR欧版 ]SUV] 9.98万-12.38万 \n" +
                "\n" +
                "GC7 ]紧凑型车] 6.19万-8.99万 \n" +
                "GX2 ]微型车] 5.09万-5.49万 \n" +
                "GX7 ]SUV] 9.29万-12.99万 \n" +
                "新自由舰 ]小型车] 3.89万-4.49万 \n" +
                "熊猫 ]微型车] 3.79万-5.89万 \n" +
                "新远景 ]紧凑型车] 5.09万-6.19万 \n" +
                "\n" +
                "350 ]紧凑型车] 8.88万-12.47万 \n" +
                "550 ]紧凑型车] 9.99万-18.98万 \n" +
                "750 ]中型车] 16.28万-25.18万 \n" +
                "750混合动力 ]其它] 23.68万-23.68万 \n" +
                "950 ]中型车] 18.89万-31.99万 \n" +
                "W5 ]SUV] 17.18万-29.88万 \n" +
                "\n" +
                "G3 ]紧凑型车] 6.98万-9.68万 \n" +
                "G5 ]中型车] 9.98万-15.28万 \n" +
                "G6 ]中大型车] 18.98万-25.98万 \n" +
                "M1 ]微型车] 3.88万-5.78万 \n" +
                "M5 ]微型车] 4.88万-6.28万 \n" +
                "X1 ]微型车] 5.28万-6.78万 \n" +
                "\n" +
                "SCEO ]SUV] 9.98万-15.88万 \n" +
                "小贵族 ]微型车] 3.69万-4.99万 \n" +
                "\n" +
                "思铭 ]紧凑型车] 11.18万-11.98万 \n" +
                "\n" +
                "H3 ]MPV] 13.98万-13.98万 \n" +
                "H5 ]MPV] 16.98万-21.38万 \n" +
                "V5 ]MPV] 9.48万-13.28万 \n" +
                "X5 ]SUV] 10.98万-14.18万 \n" +
                "\n" +
                "宏光 ]MPV] 4.48万-6.08万 \n" +
                "荣光 ]其它] 4.66万-6.68万 \n" +
                "之光 ]其它] 3.4万-4.83万 \n" +
                "兴旺 ]其它] 2.98万-3.08万 \n" +
                "\n" +
                "F99 ]SUV] 5.98万-6.78万 \n" +
                "F12 ]SUV] 5.88万-6.98万 \n" +
                "\n" +
                "金刚 ]小型车] 4.68万-5.88万 \n" +
                "金刚2代 ]小型车] 5.28万-6.28万 \n" +
                "金鹰Cross ]小型车] 5.58万-6.58万 \n" +
                "SC5-RV ]小型车] 5.53万-5.93万 \n" +
                "SC7 ]紧凑型车] 5.39万-7.69万 \n" +
                "TX4 ]中型车] 20.8万-22.8万 \n" +
                "\n" +
                "威乐 ]小型车] 6.68万-7.68万 \n" +
                "威志三厢 ]小型车] 5.38万-6.88万 \n" +
                "威志V2 ]小型车] 4.69万-5.59万 \n" +
                "威志V2 CROSS ]小型车] 5.29万-5.89万 \n" +
                "威志V5 ]小型车] 5.29万-5.99万 \n" +
                "威姿 ]小型车] 6.38万-7.68万 \n" +
                "夏利A+两厢 ]小型车] 3.18万-3.48万 \n" +
                "夏利A+三厢 ]小型车] 3.48万-3.78万 \n" +
                "夏利N3+两厢 ]小型车] 3.2万-3.4万 \n" +
                "夏利N3+三厢 ]小型车] 3.4万-3.8万 \n" +
                "夏利N5 ]小型车] 4.39万-4.99万 \n" +
                "\n" +
                "佳宝V系 ]其它] 2.69万-4.15万 \n" +
                "森雅M80 ]MPV] 5.49万-6.89万 \n" +
                "森雅S80 ]SUV] 6.79万-8.39万 \n" +
                "\n" +
                "坤程 ]其它] 6.06万-6.66万 \n" +
                "\n" +
                "H530 ]紧凑型车] 8.58万-10.38万 \n" +
                "骏捷 ]紧凑型车] 7.58万-12.88万 \n" +
                "骏捷Cross ]紧凑型车] 7.68万-10.98万 \n" +
                "骏捷FRV ]紧凑型车] 5.73万-8.53万 \n" +
                "骏捷FSV ]紧凑型车] 6.58万-9.58万 \n" +
                "骏捷Wagon ]紧凑型车] 10.88万-16.58万 \n" +
                "酷宝 ]跑车] 12.89万-18.28万 \n" +
                "V5 ]SUV] 10.98万-14.58万 \n" +
                "尊驰 ]中型车] 11.28万-24.98万\n" +
                "\n" +
                "2008 ]SUV] 4.88万-5.99万 \n" +
                "5008 ]SUV] 5.59万-7.48万 \n" +
                "江南TT ]微型车] 2.08万-2.58万 \n" +
                "Z200 ]小型车] 4.36万-6.66万 \n" +
                "Z200HB ]小型车] 4.96万-7.66万 \n" +
                "朗悦 ]紧凑型车] 6.98万-8.98万 \n" +
                "V10 ]微型车] 3.98万-5.08万 \n" +
                "Z300 ]紧凑型车] 5.9万-7.0万 \n" +
                "\n" +
                "昌铃皮卡 ]其它] 6.39万-6.79万 \n" +
                "旗舰皮卡 ]其它] 5.39万-5.99万 \n" +
                "威虎F1 ]其它] 7.19万-10.98万 \n" +
                "无限 ]SUV] 7.98万-13.43万\n" +
                "\n" +
                "迷你巴士 ]其它] 85.8万-85.8万 \n" +
                "威霆Vito3 ]MPV] 75.8万-75.8万 \n" +
                "威霆Vito5 ]MPV] 65.8万-65.8万 \n" +
                "\n" +
                "9-3 ]中型车] 34.9万-52.9万 \n" +
                "\n" +
                "S40 ]紧凑型车] 20.9万-30.8万 \n" +
                "S80L ]中大型车] 36.8万-65.99万 \n" +
                "C30 ]紧凑型车] 22.5万-24.98万 \n" +
                "C70 ]中型车] 66.1万-66.1万 \n" +
                "S60 ]中型车] 28.28万-52.98万 \n" +
                "V60 ]中型车] 44.99万-49.99万 \n" +
                "XC60 ]SUV] 40.8万-65.8万 \n" +
                "XC90 ]SUV] 59.89万-81.8万";
      public static   String[] strs = str.split("\n\n");

        //int len=strs.length;
//		List<Map<String,String>> lists=new ArrayList<>();
//		//String ]]]] a=new String]]]];
//		for (int i = 0; i < strs.length; i++) {
//			Map<String,String> map=new HashMap<>();
//			for(int j=0;i<strs]i].length();j++){
//				map.put("CarClass",strs]i]);
//			}
//			lists.add(map);
//		}
   // }
}
